Revit 2027 API
FabricationRodInfo.CanRodsBeHosted Property
 Controls whether the hanger's rod's will be automatically hosted by other elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRodsBeHosted { get; set; }
Public Property CanRodsBeHosted As Boolean
	Get
	Set
public:
property bool CanRodsBeHosted {
	bool get ();
	void set (bool value);
}
member CanRodsBeHosted : bool with get, set
Property Value
Boolean
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace